cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'Caskroom/versions'

brew 'curl', args: ['with-openssl', 'with-nghttp2']
# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'wget', args: ['with-iri']
brew 'tmux'
brew 'n'

# Install more recent versions of some macOS tools.
brew 'vim', args: ['with-override-system-vi']
brew 'grep', args: ['with-default-names']
brew 'less', args: ['with-pcre']
brew 'openssh'

# Other useful stuff
brew 'ngrep'
brew 'ctags' # For vim Tagbar

# I want to compile stuff too
brew 'automake'
brew 'autoconf'

# ZSH related stuff
brew 'zsh'
brew 'zplug' #, args: ['with-zsh']
brew 'zsh-completions'

# Install other useful binaries.
brew 'ack'
brew 'git'
brew 'stow'
brew 'tree'
brew 'dark-mode'
brew 'imagemagick', args: ['with-webp']
brew 'jq'
brew 'asciinema'
brew 'hub'
brew 'watchman'
brew 'wifi-password'
brew 'axel'
brew 'youtube-dl'
brew 'fortune'
brew 'mtr'
brew 'tig'
brew 'pv'
brew 'ssh-copy-id'
brew 'unrar'
brew 'livestreamer'
brew 'figlet'
brew 'the_silver_searcher'

# GUI Apps
# cask 'slack'
cask 'slack-beta'
cask 'iterm2'
cask 'hyperterm'
cask 'google-chrome'
cask 'atom'
# cask 'tower'
cask 'tower-beta'
cask '1password'
cask 'dropbox'
cask 'docker-beta'
cask 'istat-menus'
cask 'little-snitch'
cask 'spotify'
# cask 'cleanmymac'
cask 'boom'
cask 'sketch'
cask 'navicat-for-mysql'
cask 'vlc'
cask 'paw'
cask 'skype'
cask 'utorrent'
cask 'ngrok'
cask 'java'
cask 'ksdiff'
# brew 'flyway' # depends on Java
cask 'qlmarkdown'
cask 'kap'

# Non-essential Apps
cask 'airserver'
cask 'licecap'
cask 'numi'
cask 'steam'
cask 'codekit'
cask 'knuff'
cask 'keycastr'
cask 'dripcap'
# cask 'keepingyouawake' # or Amphetamine

# AppStore
mas 'Tweetbot', id: 557168941
mas 'Dash 3', id: 449589707
mas 'Kaleidoscope', id: 587512244
mas 'Sip', id: 507257563
mas 'DaisyDisk', id: 411643860
mas 'Amphetamine', id: 937984704 # Caffeine replacement

# Window Management [Choose One]
mas 'Magnet', id: 441258766
# mas 'Divvy', id: 413857545
# mas 'BetterSnapTool', id: 417375580
# cask 'spectacle' # Free alternative
# cask 'amethyst' # Free alternative

mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
