# brew 'curl'
brew 'curl'
# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'wget'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'less'
brew 'openssh'

# Other Essentials
# Better ls
brew 'lsd'
brew 'btop'

# Other useful stuff
brew 'ctags' # For vim Tagbar

# I want to compile stuff too
brew 'automake'
brew 'autoconf'
brew 'pkg-config'

# ZSH related stuff
brew 'zsh'
brew 'zinit'
brew 'zsh-completions'

# Install other useful binaries.
brew 'ack'
brew 'tmux'
brew 'tpm'
brew 'tmuxinator'
brew 'tmuxinator-completion'
brew 'zellij'
brew 'fnm'
brew 'starship'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'lazygit'
brew 'stow'
brew 'tree'
# brew 'imagemagick'
brew 'jq'
brew 'yq'
brew 'asciinema'
brew 'vhs'
brew 'fortune'
brew 'mtr'
# Pipe Viewer
brew 'pv'
brew 'ssh-copy-id'
# Banner-like program prints strings as ASCII art
brew 'figlet'
brew 'fzf'
brew 'bat'
brew 'fd'
brew 'ripgrep'
brew 'exiftool'
brew 'neofetch'
brew 'tldr'
brew 'ffmpeg'
brew 'mas'
brew 'nmap'
brew 'entr'
brew 'shellcheck'
brew 'shfmt'
brew 'zoxide'
brew 'watchman'

# GUI Apps
cask_args appdir: '/Applications'

# cask 'slack'
cask 'iterm2'
cask '1password'
cask '1password-cli'
mas "1Password for Safari", id: 1569813296
cask 'istat-menus'
cask 'kap'
cask 'finicky'
cask 'wezterm'

# Non-essential Apps
cask 'keycastr'
cask 'visual-studio-code'
# cask 'keyboard-cleaner'
cask 'keyboardcleantool'
# Change icons
cask 'cleanmymac'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-monaspace'
cask 'font-noto-color-emoji'
cask 'font-symbols-only-nerd-font'

# AppStore
mas 'Kaleidoscope', id: 587512244
mas 'DaisyDisk', id: 411643860
mas 'Amphetamine', id: 937984704 # Caffeine replacement

mas 'parcel', id: 639968404
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
