brew 'curl'
# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
brew 'gnu-sed'
brew 'wget'
brew 'tmux'
brew 'fnm'
brew 'starship'

# Install more recent versions of some macOS tools.
brew 'vim'
brew 'grep'
brew 'less'
brew 'openssh'

# Other Essentials
# Better ls
brew 'exa'

# Other useful stuff
brew 'ctags' # For vim Tagbar

# I want to compile stuff too
brew 'automake'
brew 'autoconf'

# ZSH related stuff
brew 'zsh'
brew 'zinit'
brew 'zsh-completions'

# Install other useful binaries.
brew 'ack'
brew 'git'
brew 'stow'
brew 'tree'
# brew 'imagemagick'
brew 'jq'
brew 'asciinema'
brew 'hub'
brew 'fortune'
brew 'mtr'
brew 'tig'
# Pipe Viewer
brew 'pv'
brew 'ssh-copy-id'
# Banner-like program prints strings as ASCII art
brew 'figlet'
brew 'fzf'
brew 'bat'
brew 'ripgrep'
brew 'exiftool'
brew 'neofetch'
# To connect/disconnect AirPods
brew 'bluetoothconnector'

# GUI Apps
tap 'homebrew/cask'
cask_args appdir: '/Applications'

# cask 'slack'
cask 'iterm2'
cask '1password'
# cask 'docker-beta'
cask 'istat-menus'
# cask 'little-snitch'
cask 'spotify'
cask 'sketch'
cask 'vlc'
# cask 'paw'
# cask 'ngrok'
# cask 'ksdiff'
cask 'kap'
cask 'sublime-merge'
cask 'alfred'

# Non-essential Apps
# cask 'airserver'
cask 'airflow'
# cask 'licecap'
cask 'numi'
cask 'keycastr'
cask 'visual-studio-code'
# cask 'dripcap'
# cask 'keepingyouawake' # or Amphetamine
# Clean your keyboard like never before :P
# cask 'keyboard-cleaner'
cask 'keyboardcleantool'
# Change icons
cask 'pictogram'
cask 'cleanmymac'

# Games
# cask 'steam'
cask 'battle-net'
cask 'hstracker'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fantasque-sans-mono'
cask 'font-monofur-nerd-font'
cask 'font-recursive'

# AppStore
mas 'Tweetbot', id: 557168941
# mas 'Dash 3', id: 449589707
mas 'Kaleidoscope', id: 587512244
# mas 'Sip', id: 507257563
mas 'DaisyDisk', id: 411643860
mas 'Amphetamine', id: 937984704 # Caffeine replacement

# Window Management [Choose One]
# mas 'Divvy', id: 413857545
# mas 'Magnet', id: 441258766
# mas 'BetterSnapTool', id: 417375580
# cask 'spectacle' # Free alternative
# cask 'amethyst' # Free alternative

mas 'parcel', id: 639968404
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
